Repository: zipf/perldoc-es
Catalog: memory/clean/omegat_clean_prj-level2.tmx
Source language: en_us
Languages: es

source: Permanent aliases are explicitly created in L<packages|/package> by L<importing|/import> symbols or by assignment to L<typeglobs|/typeglob>.
es: Se crean alias permanentes explícitamente en L<paquetes|/paquete> mediante la L<importación|/importar> de símbolos o la asignación a L<typeglobs|/typeglob>.

source: Platform-specific pieces of the build system also live in platform-specific directories like F , F<vms/>, etc.
es: Las partes del sistema de compilación que son específicas de la plataforma se encuentran en directorios específicos de plataforma, como F , F<vms/>, etc.

source: Please don't send me mail asking for help on how to install your modules.
es: No deseo recibir mensajes de petición de ayuda para instalar módulos.

source: Please keep in mind that many of them are code fragments rather than complete programs.
es: Tenga en cuenta que muchos de estos ejemplos son fragmentos de código, no programas completos.

source: Please note that the first C<good> state must be an ancestor of the first C<bad> state.
es: Tenga en cuenta que el primer estado C<correcto> debe ser un antecesor del primer estado C<incorrecto>.

source: Please read L<perlhack> first in order to figure out where your patches should be sent.
es: En L<perlhack> encontrará la dirección a la que debe enviar sus parches.

source: Please report any errors, updates, or suggestions to F<perlbug@perl.org>.
es: Para notificar errores, actualizaciones o sugerencias, utilice la dirección F<perlbug@perl.org>.

source: Please see its README file in L<http://perl5.git.perl.org/metaconfig.git/> for more details.
es: Consulte el archivo README (en L<http://perl5.git.perl.org/metaconfig.git/>) para obtener información detallada.

source: Please think carefully about doing this.
es: Antes de hacer esto, piénselo.

source: Please, unless you're hacking the internals, or debugging weirdness, don't think about the UTF8 flag at all.
es: A menos que tenga que trabajar con los componentes internos o depurar cosas extrañas, olvídese de la marca UTF8.

source: Please.
es: Por favor.

source: Pointer to the linearisation function, described below.
es: Puntero a la función de linealización, que se describe a continuación.

source: Poison(dst, n, t) equal to PoisonFree(dst, n, t)
es: Poison(dst, n, t) igual que PoisonFree(dst, n, t)

source: PoisonFree(dst, n, t) equal to PoisonWith(dst, n, t, 0xEF)
es: PoisonFree(dst, n, t) igual que PoisonWith(dst, n, t, 0xEF)

source: PoisonNew(dst, n, t) equal to PoisonWith(dst, n, t, 0xAB)
es: PoisonNew(dst, n, t) igual que PoisonWith(dst, n, t, 0xAB)

source: PoisonWith(dst, n, t, b) scribble memory with byte b
es: PoisonWith(dst, n, t, b) "garabatea" el byte b en la memoria

source: Poisoning can be done using the Poison() macros, which have similar arguments to Zero():
es: El envenenamiento se puede realizar mediante las macros Poison(), que tienen argumentos similares a los de Zero():

source: Polymorphism is one of the key concepts of object-oriented design.
es: El polimorfismo es uno de los conceptos clave del diseño orientado a objetos.

source: Ponie stands for "Perl On the New Internal Engine", started by Arthur Bergman from Fotango in 2003, and subsequently run as a project of The Perl Foundation.
es: Ponie significa "Perl On the New Internal Engine" (Perl en el nuevo motor interno). Este proyecto lo inició Arthur Bergman (de Fotango) en 2003, y posteriormente lo adoptó The Perl Foundation.

source: Porting programs written in platform-dependent languages such as C can be difficult work, but porting programs like Perl is very much worth the agony.
es: Adaptar programas escritos en lenguajes dependientes de la plataforma, como C, puede ser difícil, pero la adaptación de programas como Perl merece la pena.

source: Positive assertions match when their subpattern matches, negative assertions match when their subpattern fails.
es: Se detectan aserciones positivas cuando los subpatrones coinciden y aserciones negativas cuando los subpatrones no coinciden.

source: Possessing a complete name.
es: Que posee un nombre completamente cualificado.

source: Possessive quantifiers are equivalent to putting the item they are applied to inside of one of these constructs.
es: Los cuantificadores posesivos equivalen a colocar dentro de una de estas construcciones el elemento a los que se aplican los cuantificadores.

source: Pragmas are named in all lowercase.
es: Los nombres de pragmas se escriben en minúsculas.

source: Precisely which areas are good and bad is often a personal choice, so asking this question on Usenet runs a strong risk of starting an unproductive Holy War.
es: Precisamente las áreas en las que es bueno o malo suelen ser una opción personal, por lo que hacer esta pregunta en Usenet conlleva un riesgo elevado de iniciar una guerra santa inútil.

source: Preserve the string matched such that ${^PREMATCH}, ${^MATCH}, and ${^POSTMATCH} are available for use after matching.
es: Conserva la cadena coincidente, de manera que ${^PREMATCH}, ${^MATCH} y ${^POSTMATCH} estén disponibles tras la detección.

source: Prints out a brief B<h>elp message.
es: Imprime en pantalla un breve mensaje de ayuda ("h" viene de la palabra inglesa B<h>elp).

source: Prior to 5.14, there were no explicit modifiers, but C</l> was implied for regexes compiled within the scope of C<use locale>, and C</d> was implied otherwise.
es: Antes de la versión 5.14 no existían modificadores explícitos, pero C</l> estaba implícito para expresiones regulares compiladas en el ámbito de C<use locale>, y en los demás casos estaba implícito C</d>.

source: Prior to that there were no named nor relative numbered capture groups.
es: Antes de esta versión no existían los grupos de captura con nombre o numerados de forma relativa.

source: Probably the best thing to do is try to write equivalent code to do a set of tasks.
es: Probablemente lo mejor sea escribir código equivalente para realizar una serie de tareas.

source: Process
es: Procesar

source: Processing happens as you knew before.
es: El procesamiento se realiza igual que antes.

source: Production releases, which incorporate bug fixes and new functionality, are widely tested before release.
es: Las versiones de producción, que incorporan correcciones de errores y funcionalidad nueva, se someten a pruebas intensivas antes de su lanzamiento.

source: Programming in which the orderly sequence of events can be determined; that is, when things happen one after the other, not at the same time.
es: Programación en la que se puede determinar la secuencia ordenada de eventos; es decir, las cosas suceden de una en una, no a la vez.

source: Programs for which the source code is freely available and freely redistributable, with no commercial strings attached.
es: Programas para los que el código fuente está disponible gratuitamente y se puede redistribuir gratuitamente, sin descripción comercial asociada.

source: Pronounced TimToady.
es: En inglés se pronuncia TimToady.

source: Provide a good synopsis of how your module is used in code, a description, and then notes on the syntax and function of the individual subroutines or methods.
es: Debe incluir una sinopsis adecuada que explique cómo se usa el módulo, una descripción, notas sobre la sintaxis y el propósito de las subrutinas o los métodos individuales.

source: Providing the appearance of something without the reality, as in: virtual memory is not real memory.
es: Proporciona el aspecto de algo que no es real, como en "la memoria virtual no es memoria real".

source: Pump- Release Date diff lines kB
es: Pump- Versión Fecha dif. líneas en kB

source: Pump- Release Date Notes
es: Pumpking Versión Fecha Notas

source: Putting a fancy L</data structure> into linear order so that it can be stored as a L</string> in a disk file or database or sent through a L</pipe>.
es: Proceso de colocar una L</estructura de datos> sofisticada en orden lineal de forma que se pueda almacenar como una L</cadena> en un archivo de disco o una base de datos, o se pueda enviar a través de una L</tubería>.

source: Qualify the signal handler name if you wish to have a signal handler in a package.)
es: califique el nombre del controlador de señal si desea que esté en un paquete).

source: Quantifier Form Bracketing Form
es: Forma cuantificador Forma con paréntesis

source: Quantifiers can be used to specify how many of the previous thing you want to match on, where "thing" means either a literal character, one of the metacharacters listed above, or a group of characters or metacharacters in parentheses.
es: Los cuantificadores se utilizan para especificar cuántas coincidencias de lo anterior (un carácter literal, uno de los metacaracteres antes especificados o un grupo de caracteres o metacaracteres entre paréntesis) se desea detectar.

source: Query or change configuration of Perl modules that use Module::Build-based configuration files for features and config data.
es: Permite consultar o modificar la configuración de módulos Perl que usan archivos de configuración basados en Module::Build para características y datos de configuración.

source: REFERENCES
es: REFERENCIAS

source: RV also means an internal Reference Value of the type a L</scalar> can hold.
es: RV también es un valor de referencia (Reference Value) interno del tipo que se puede almacenar en un L</escalar>.

source: Radios and computers are not specializations of this parent.
es: Las radios y los equipos no son casos especiales de esta clase primaria.

source: Rafael 5.10.0 2007-Dec-18
es: Rafael 5.10.0 2007-Dic-18

source: Rafael 5.6.2-RC1 2003-Nov-08 5.6.2 2003-Nov-15 Fix new build issues
es: Rafael 5.6.2-RC1 2003-Nov-08 5.6.2 2003-Nov-15 Corrección de problemas de la nueva versión

source: Rafael 5.9.1 2004-Mar-16 5.9.2 2005-Apr-01 5.9.3 2006-Jan-28 5.9.4 2006-Aug-15 5.9.5 2007-Jul-07 5.10.0-RC1 2007-Nov-17 5.10.0-RC2 2007-Nov-25
es: Rafael 5.9.1 2004-Mar-16 5.9.2 2005-Abr-01 5.9.3 2006-Ene-28 5.9.4 2006-Ago-15 5.9.5 2007-Jul-07 5.10.0-RC1 2007-Nov-17 5.10.0-RC2 2007-Nov-25

source: Rafael 5.9.1 2004-Mar-16 57 250 2107 5.9.2 2005-Apr-01 720 57 858 5.9.3 2006-Jan-28 1124 102 1906 5.9.4 2006-Aug-15 896 60 862 5.9.5 2007-Jul-07 1149 128 1062
es: Rafael 5.9.1 2004-Mar-16 57 250 2107 5.9.2 2005-Abr-01 720 57 858 5.9.3 2006-Ene-28 1124 102 1906 5.9.4 2006-Ago-15 896 60 862 5.9.5 2007-Jul-07 1149 128 1062

source: Read L<perlboot>, L<perltoot>, L<perltooc> and L<perlobj>.
es: Lea L<perlboot>, L<perltoot>, L<perltooc> y L<perlobj> para obtener más información.

source: Read all about it (and other special variables) in L<perlvar>.
es: Encontrará información sobre este hash (y sobre otras variables especiales) en L<perlvar>.

source: Read all about them in L<perlrequick>, L<perlretut>, and L<perlre>.
es: Encontrará más información en L<perlrequick>, L<perlretut> y L<perlre>.

# Read perlmod for the rest of the story. " }
source: Read perlmod for the rest of the story.\n" }
es: Lea perlmod para obtener más información.\n" }

source: Read the F<INSTALL> file, which is part of the source distribution.
es: Lea el archivo F<INSTALL> incluido en la distribución de código fuente.

source: Read the cpan-mac directions carefully and install it.
es: Lea atentamente las instrucciones de cpan-mac e instálelo.

source: Read the documentation to see if the module will work on your system.
es: Lea la documentación para ver si el módulo funciona en su sistema.

source: Read the module's documentation, looking for reasons why you might have trouble using it with MacPerl.
es: Lea la documentación del módulo en busca de razones que impidan su uso con MacPerl.

source: Read-only attributes can only be set when the object is first created, while read-write attributes can be altered at any time.
es: Los atributos de solo lectura solo se pueden asignar al crear el objeto; los de lectura y escritura pueden modificarse en cualquier momento.

source: Reading in the whole file at one time is called slurping.
es: La lectura de un archivo completo se suele llamar "slurping" (succión).

source: Reading the C<$!> variable gives you the current system error number or message.
es: Puede leer el valor de la variable C<$!> para averiguar cuál es el número o mensaje de error actual del sistema.

source: Really.
es: En realidad,

source: Rebase as follows (assuming your work was on the branch C<< committer/somework >>):
es: La reorganización se realiza como se indica a continuación (suponiendo que el trabajo está en la rama C<< contribuidor/trabajo >>):

source: Recall that which of C<yes-pattern> or C<no-pattern> actually matches is already determined.
es: Recuerde que la coincidencia de C<patrón-sí> o de C<patrón-no> ya está determinada.

source: Receive and decode
es: Recibir y descodificar

source: Recently there has been a trend to use the term in contradistinction to L</open source software>, to refer only to free software released under the Free Software Foundation's GPL (General Public License), but this is difficult to justify etymologically.
es: Recientemente se ha puesto de moda usar este término en contradicción con L</software open source>, para referirse únicamente al software libre publicado con la licencia GPL (General Public License) de la Free Software Foundation, pero es difícil justificar esto desde un punto de vista etimológico.

source: Recommended reading is "The Absolute Minimum Every Software Developer Absolutely, Positively Must Know About Unicode and Character Sets (No Excuses!)" by Joel Spolsky, at L<http://joelonsoftware.com/articles/Unicode.html>.
es: Para adquirir estos conocimientos básicos, es recomendable leer el artículo "The Absolute Minimum Every Software Developer Absolutely, Positively Must Know About Unicode and Character Sets (No Excuses!)" de Joel Spolsky, en L<http://joelonsoftware.com/articles/Unicode.html>.

source: Recurse to a named subpattern.
es: Se ejecuta de forma recursiva hasta un subpatrón con nombre.

source: Recursing deeper than 50 times without consuming any input string will also result in a fatal error.
es: Realizar un proceso recursivo más de 50 veces sin consumir ninguna cadena de entrada generará un error irrecuperable.

source: Recursing deeper than 50 times without consuming any input string will result in a fatal error.
es: Realizar un proceso recursivo más de 50 veces sin consumir ninguna cadena de entrada generará un error irrecuperable.

source: Recursion is of unlimited depth.
es: La profundidad de recursión es ilimitada.

source: Recursive search.
es: Búsqueda recursiva.

source: Reduced to a standard form to facilitate comparison.
es: Reducido a una forma estándar para facilitar la comparación.

source: References come in two flavors, L<symbolic references|/symbolic reference> and L<hard references|/hard reference>.
es: Hay dos tipos de referencias: L<referencias simbólicas|/referencia simbólica> y L<referencias estrictas|/referencia estricta>.

source: Regarding aesthetics of code lay out, about the only thing Larry cares strongly about is that the closing curly bracket of a multi-line BLOCK should line up with the keyword that started the construct.
es: Con respecto a la estética del código, lo único que le importa a Larry es que la llave de cierre de un BLOQUE multilínea esté alineada con la palabra reservada con la que se inició esa estructura.

source: Regular expression modifiers are usually written in documentation as e.g., "the C</x> modifier", even though the delimiter in question might not really be a slash.
es: En la documentación se suele hacer referencia a los modificadores de expresiones regulares como "el modificador C</x>" (p. ej.), aunque el delimitador en cuestión puede no ser una barra diagonal.

source: Regular expressions provide a terse and powerful programming language.
es: Las expresiones regulares proporcionan un lenguaje de programación conciso y eficaz.

source: Remember that it has to be C because the first character of the string is the C<U> which has been swallowed into C<datumtype!>
es: Recuerde que tiene que ser C, ya que el primer carácter de la cadena es la C<U> consumida por C<datumtype>.

source: Remember that the look-aheads are zero-width expressions--they only look, but don't consume any of the string in their match.
es: Recuerde que las aserciones de inspección hacia adelante son expresiones de ancho cero: solo inspeccionan, pero no utilizan ninguna parte de la cadena de caracteres en su coincidencia.

source: Remember that this is a closed list with a very long turn-around time - be prepared to wait a good while for a response from them.
es: Recuerde que se trata de una lista cerrada con un tiempo de respuesta largo; seguramente tardarán en contestar.

source: Remember, people often respond better to what they get out of it.
es: Recuerde que las personas suelen ser más receptivas cuando algo les proporciona un beneficio.

source: Remember, under the hood, this object is still just a hash.
es: Hay que tener presente que el objeto es, en realidad, un hash.

source: Removed in Perl 5.10 XXX
es: Se eliminó en Perl 5.10 XXX

source: Removed in Perl 5.10.1
es: Se eliminó en Perl 5.10.1

source: Removed in Perl 5.8.8
es: Se eliminó en Perl 5.8.8

source: Removed in Perl 5.9.0
es: Se eliminó en Perl 5.9.0

source: Removed in Perl 5.9.5
es: Se eliminó en Perl 5.9.5

source: Removed in: 5.11.3
es: Se eliminó en 5.11.3

source: Represented within a Perl program by the L</filehandle> L</STDIN>.
es: En un programa Perl se representa mediante el L</identificador de archivo> L</STDIN>.

source: Represented within a Perl program by the L</filehandle> L</STDOUT>.
es: En un programa Perl se representa mediante el L</identificador de archivo> L</STDOUT>.

source: Represented within a Perl program by the L</filehandle> L</STDERR>.
es: En un programa Perl se representa mediante el L</identificador de archivo> L</STDERR>.

source: Request For Comment, which despite the timid connotations is the name of a series of important standards documents.
es: Request For Comment (Solicitud de comentarios). Pese a sus tímidas connotaciones, es el nombre de una serie de importantes documentos sobre normas.

source: Ricardo 5.11.4 2010-Jan-20
es: Ricardo 5.11.4 2010-Ene-20

source: Ricardo 5.12.3 2011-Jan-21
es: Ricardo 5.12.3 2011-Ene-21

source: Ricardo 5.12.3-RC1 2011-Jan-09
es: Ricardo 5.12.3-RC1 2011-Ene-09

source: Ricardo 5.12.3-RC2 2011-Jan-14
es: Ricardo 5.12.3-RC2 2011-Ene-14

source: Ricardo 5.12.3-RC3 2011-Jan-17
es: Ricardo 5.12.3-RC3 2011-Ene-17

source: Ricardo 5.15.2 2011-Aug-20
es: Ricardo 5.15.2 2011-Ago-20

source: Ricardo 5.16.0 2012-May-20 The 5.16 maintenance track
es: Ricardo 5.16.0 2012-May-20 Serie de mantenimiento de v5.16

source: Ricardo 5.16.1 2012-Aug-08
es: Ricardo 5.16.1 2012-Ago-08

source: Ricardo 5.16.1-RC1 2012-Aug-03
es: Ricardo 5.16.1-RC1 2012-Ago-03

source: Richard 1.0_16 2003-Dec-18
es: Richard 1.0_16 2003-Dic-18

source: Roles are B<applied> to classes.
es: Los roles se B<aplican> a las clases.

source: Roles are an alternative to inheritance for providing polymorphism.
es: Los roles son una alternativa a la herencia para ofrecer polimorfismo.

source: Roles are relatively new to Perl, but have become rather popular.
es: Son relativamente recientes en Perl, pero su uso se ha popularizado.

source: Roughly like a document, if you're into office metaphors.
es: Puede considerarse equivalente a un documento, si le agradan las metáforas relacionadas con la oficina.

source: Run C<Porting/bisect.pl --help> for the full documentation, including how to set the C<Configure> and build time options.
es: Ejecute C<Porting/bisect.pl --help> para ver toda la documentación, que incluye una descripción de la configuración mediante C<Configure> y las opciones de tiempo de compilación.

source: Run C<perl Porting/Maintainers -M Module::Name> to find out more information about a dual-life module.
es: Ejecute C<perl Porting/Maintainers -M Nombre::Módulo> para obtener más información sobre un módulo de evolución dual.

source: Run C<perldoc perldoc> to learn more things you can do with F<perldoc>.
es: Ejecute C<perldoc perldoc> para ver qué más puede hacer con <perldoc>.

source: Run by O'Reilly Media (the publisher of L<the Camel Book|perlbook>, among other Perl-related literature), perl.com provides current Perl news, articles, and resources for Perl developers as well as a directory of other useful websites.
es: Dirigido por O'Reilly Media (la editorial del L<libro del Camello|perlbook>, entre muchos otros libros sobre Perl), perl.com ofrece noticias de actualidad Perl, artículos y recursos para desarrolladores de Perl, así como un directorio de otros sitios web útiles.

source: Run phase is mostly spent in L</run time> but may also be spent in L</compile time> when L<require|perlfunc/require>, L<do|perlfunc/do> C<FILE>, or L<eval|perlfunc/eval> C<STRING> operators are executed or when a substitution uses the C</ee> modifier.
es: La fase de ejecución se dedica en su mayor parte al L</tiempo de ejecución>, pero también puede dedicarse a L</tiempo de compilación> si se ejecutan los operadores L<require|perlfunc/require>, L<do|perlfunc/do> C<ARCHIVO> o L<eval|perlfunc/eval> C<CADENA>, o cuando una sustitución usa el modificador C</ee>.

source: Run the test suite.
es: Ejecute el conjunto de pruebas.

# Run this again, using Perl's -c switch. " }
source: Run this again, using Perl's -c switch.\n" }
es: Volvemos a ejecutar esto, ahora con el modificador -c de perl.\n" }

source: Run-time patterns are useful but expensive.
es: Los patrones de tiempo de ejecución son útiles pero costosos.

source: Running the test target given in the next item would have caught this problem.
es: Si se hubiera ejecutado el objetivo de prueba del siguiente elemento, se habría detectado este problema.

source: S<[ B<-C [I<number/list>] >]>
es: S<[ B<-C [I<número/lista>] >]>

source: S<[ B<-I>I<dir> ] [ B<-m>[B<->]I<module> ] [ B<-M>[B<->]I<'module...'> ] [ B<-f> ]>
es: S<[ B<-I>I<dir> ] [ B<-m>[B<->]I<módulo> ] [ B<-M>[B<->]I<'módulo...'> ] [ B<-f> ]>

source: S<[ B<-cw> ] [ B<-d>[B<t>][:I<debugger>] ] [ B<-D>[I<number/list>] ]>
es: S<[ B<-cw> ] [ B<-d>[B<t>][:I<depurador>] ] [ B<-D>[I<número/lista>] ]>

source: S<[ B<-hv> ] [ B<-V>[:I<configvar>] ]>
es: S<[ B<-hv> ] [ B<-V>[:I<var_config>] ]>

source: S<[ B<-i>[I<extension>] ]>
es: S<[ B<-i>[I<extensión>] ]>

source: S<[ B<-pna> ] [ B<-F>I<pattern> ] [ B<-l>[I<octal>] ] [ B[I<octal/hexadecimal>] ]>
es: S<[ B<-pna> ] [ B<-F>I<patrón> ] [ B<-l>[I<octal>] ] [ B[I<octal/hexadecimal>] ]>

source: S<[ [B<-e>|B<-E>] I<'command'> ] [ B<--> ] [ I<programfile> ] [ I<argument> ]...>
es: S<[ [B<-e>|B<-E>] I<'comando'> ] [ B<--> ] [ I<archivo_programa> ] [ I<argumento> ]...>

source: SUPER->save($thing); # FAIL: looks for save() method in class # SUPER
es: SUPER->guardar($algo); # ERROR: busca el método guardar() en la # clase SUPER

source: SUPER::save($thing); # FAIL: looks for save() sub in package SUPER
es: SUPER::guardar($algo); # ERROR: busca la subrutina guardar() en el paquete SUPER

source: Said of a L</function> that happily receives an indeterminate number of L</actual arguments>.
es: Se dice de una L</función> que recibe alegremente un número indeterminado de L</argumentos reales>.

source: Said of a program that runs with the privileges of its L</owner> rather than (as is usually the case) the privileges of whoever is running it.
es: Se dice de un programa que se ejecuta con los privilegios de su L</propietario> en lugar de (como suele ser el caso) los privilegios de quien lo ejecuta.
